In [3]:
import pandas as pd
import numpy as np

a = pd.Series(np.arange(3), index=['a', 'b', 'c'])
b = pd.Series(np.arange(5, 8), index=[ 'b', 'c', 'd'])
c = a.add(b,fill_value= 0)
c

a    0.0
b    6.0
c    8.0
d    7.0
dtype: float64

In [5]:
frame = pd.DataFrame(np.arange(12.0).reshape(4, 3), columns=list('abc'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          a     b     c
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [8]:
frame.iloc[0, :]

a    0.0
b    1.0
c    2.0
Name: Utah, dtype: float64

In [15]:
frame2 = pd.DataFrame(np.arange(18., 30.).reshape(4, 3), columns=list('abc'), index=[ 'Ohio', 'Texas', 'Oregon', 'New York'])
frame2

             a     b     c
Ohio      18.0  19.0  20.0
Texas     21.0  22.0  23.0
Oregon    24.0  25.0  26.0
New York  27.0  28.0  29.0

In [16]:
frame + frame2

             a     b     c
New York   NaN   NaN   NaN
Ohio      21.0  23.0  25.0
Oregon    33.0  35.0  37.0
Texas     27.0  29.0  31.0
Utah       NaN   NaN   NaN

In [17]:
frame.add(frame2, fill_value= 0.)

             a     b     c
New York  27.0  28.0  29.0
Ohio      21.0  23.0  25.0
Oregon    33.0  35.0  37.0
Texas     27.0  29.0  31.0
Utah       0.0   1.0   2.0

In [20]:
series = frame.iloc[0]
frame - series

          a    b    c
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [21]:
frame + series

          a     b     c
Utah    0.0   2.0   4.0
Ohio    3.0   5.0   7.0
Texas   6.0   8.0  10.0
Oregon  9.0  11.0  13.0

In [24]:
series.min()
series.max()

2.0